1107979819/STM32F103T8U6-Crazepony/User/led/bsp_led.h
#ifndef __LED_H
#define	__LED_H

#include "stm32f10x.h"

/** the macro definition to trigger the led on or off 
  * 1 - off
  *0 - on
  */
#define ON  0
#define OFF 1

/* 带参宏，可以像内联函数一样使用 */

#define LED1(a)	if (a)	\
					GPIO_SetBits(GPIOA,GPIO_Pin_11);\
					else		\
					GPIO_ResetBits(GPIOA,GPIO_Pin_11)
					
#define LED2(a)	if (a)	\
					GPIO_SetBits(GPIOA,GPIO_Pin_8);\
					else		\
					GPIO_ResetBits(GPIOA,GPIO_Pin_8)
					
#define LED3(a)	if (a)	\
					GPIO_SetBits(GPIOB,GPIO_Pin_1);\
					else		\
					GPIO_ResetBits(GPIOB,GPIO_Pin_1)
					
#define LED4(a)	if (a)	\
					GPIO_SetBits(GPIOB,GPIO_Pin_3);\
					else		\
					GPIO_ResetBits(GPIOB,GPIO_Pin_3)						
					

/* 直接操作寄存器的方法控制IO */
#define	digitalHi(p,i)			{p->BSRR=i;}			//设置为高电平		
#define digitalLo(p,i)			{p->BRR=i;}				//输出低电平
#define digitalToggle(p,i)		{p->ODR ^=i;}			//输出反转状态


/* 定义控制IO的宏 */

#define LED1_TOGGLE		digitalToggle(GPIOA,GPIO_Pin_11)
#define LED1_OFF		digitalHi(GPIOA,GPIO_Pin_11)
#define LED1_ON			digitalLo(GPIOA,GPIO_Pin_11)

#define LED2_TOGGLE		digitalToggle(GPIOA,GPIO_Pin_8)
#define LED2_OFF		digitalHi(GPIOA,GPIO_Pin_8)
#define LED2_ON			digitalLo(GPIOA,GPIO_Pin_8)

#define LED3_TOGGLE		digitalToggle(GPIOB,GPIO_Pin_1)
#define LED3_OFF		digitalHi(GPIOB,GPIO_Pin_1)
#define LED3_ON			digitalLo(GPIOB,GPIO_Pin_1)

#define LED4_TOGGLE		digitalToggle(GPIOB,GPIO_Pin_3)
#define LED4_OFF		digitalHi(GPIOB,GPIO_Pin_3)
#define LED4_ON			digitalLo(GPIOB,GPIO_Pin_3)

void LED_GPIO_Config(void);

#endif /* __LED_H */
